OpenFOAM-v2506/tutorials/combustion/fireFoam/LES/compartmentFire/0.orig/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }

    entrainment
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }

    outlet
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }

    region0_to_panelRegion_wallPanel
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }

    region0_to_panelRegion_internalWallPanel_top
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }

    region0_to_panelRegion_internalWallPanel_bottom
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
}


// ************************************************************************* //
